In [2]:
import pandas as pd

In [6]:
df = pd.read_csv('Titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [14]:
df["Sex"] == "male"

0       True
1      False
2       True
3       True
4      False
       ...
413     True
414    False
415     True
416     True
417     True
Name: Sex, Length: 418, dtype: bool

In [16]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [20]:
pd.Categorical(df["Survived"])

[0, 1, 0, 0, 1, ..., 0, 1, 0, 0, 0]
Length: 418
Categories (2, int64): [0, 1]

In [34]:
len(df[df['Age'] < 20])

61

In [48]:
df[(df['Age'] == 20) & (df['Sex'] == 'male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
235,1127,0,3,"Vendel, Mr. Olof Edvin",male,20.0,0,0,350416,7.8542,NaN,S
237,1129,0,3,"Baccos, Mr. Raffull",male,20.0,0,0,2679,7.2250,NaN,C
251,1143,0,3,"Abrahamsson, Mr. Abraham August Johannes",male,20.0,0,0,SOTON/O2 3101284,7.9250,NaN,S
405,1297,0,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male,20.0,0,0,SC/PARIS 2166,13.8625,D38,C

In [60]:
maxfare = max(df["Fare"])
maxfare

512.3292

In [68]:
df[(df['Age'] >= 20) & (df['Sex'] == 'female') & (df["Fare"] == maxfare)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
343,1235,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C

In [72]:
s = df["Name"][0:10]
s

0                                Kelly, Mr. James
1                Wilkes, Mrs. James (Ellen Needs)
2                       Myles, Mr. Thomas Francis
3                                Wirz, Mr. Albert
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
5                      Svensson, Mr. Johan Cervin
6                            Connolly, Miss. Kate
7                    Caldwell, Mr. Albert Francis
8       Abrahim, Mrs. Joseph (Sophie Halaut Easu)
9                         Davies, Mr. John Samuel
Name: Name, dtype: object

In [74]:
l = ['a','b','c','d','e','f','g','h','i','j']
l

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [102]:
s1 = pd.Series(list(s),index=l)
s1

a                                Kelly, Mr. James
b                Wilkes, Mrs. James (Ellen Needs)
c                       Myles, Mr. Thomas Francis
d                                Wirz, Mr. Albert
e    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
f                      Svensson, Mr. Johan Cervin
g                            Connolly, Miss. Kate
h                    Caldwell, Mr. Albert Francis
i       Abrahim, Mrs. Joseph (Sophie Halaut Easu)
j                         Davies, Mr. John Samuel
dtype: object

In [130]:
s = (s)+(s1)
s

ValueError: operands could not be broadcast together with shapes (30,) (10,)